consumers/src/unit-test/resources/ClaimDefences.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:sub="http://ws.sdt.moj.gov.uk/2013/sdt/SubmitQueryRequestSchema" xmlns:quer="http://ws.sdt.moj.gov.uk/2013/mcol/QuerySchema">
  <soap:Header/>
  <soap:Body>
    <sub:submitQueryRequest>
      <sub:header>
        <sub:sdtCustomerId>12345678</sub:sdtCustomerId>
        <sub:targetApplicationId>mcol</sub:targetApplicationId>
        <sub:queryReference>optional</sub:queryReference>
      </sub:header>
      <sub:criteria>
        <sub:criterion criteriaType="mcolDefenceCriteria">
          <sub:mcolDefenceCriteria>
            <quer:fromDate>2009-12-01</quer:fromDate>
            <quer:toDate>2009-12-02</quer:toDate>
          </sub:mcolDefenceCriteria>
        </sub:criterion>
      </sub:criteria>
    </sub:submitQueryRequest>
  </soap:Body>
</soap:Envelope>
