src/functionalTest/resources/statusUpdate.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bul="http://ws.sdt.moj.gov.uk/2013/sdt/BulkRequestSchema" xmlns:cla="http://ws.sdt.moj.gov.uk/2013/mcol/ClaimSchema" xmlns:bas="http://ws.sdt.moj.gov.uk/2013/sdt/BaseSchema" xmlns:jud="http://ws.sdt.moj.gov.uk/2013/mcol/JudgmentSchema" xmlns:cla1="http://ws.sdt.moj.gov.uk/2013/mcol/ClaimStatusUpdateSchema" xmlns:war="http://ws.sdt.moj.gov.uk/2013/mcol/WarrantSchema">
   <soap:Header/>
   <soap:Body>
      <bul:bulkRequest>
         <bul:header>
            <bul:sdtCustomerId>10000001</bul:sdtCustomerId>
            <bul:targetApplicationId>mcol</bul:targetApplicationId>
            <bul:requestCount>1</bul:requestCount>
            <bul:customerReference>RANDOM_NUMBER</bul:customerReference>
         </bul:header>
         <bul:requests>
            <bul:request requestType="mcolClaimStatusUpdate" requestId="RANDOM_NUMBER">
               <bul:mcolClaimStatusUpdate>
                  <cla1:claimNumber>9QZ00009</cla1:claimNumber>
                  <cla1:notificationType>WD</cla1:notificationType>
               </bul:mcolClaimStatusUpdate>
            </bul:request>
         </bul:requests>
      </bul:bulkRequest>
   </soap:Body>
</soap:Envelope>
